app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["body", "test test"], ["created_at", "2016-03-16 23:14:24.113230"], ["updated_at", "2016-03-16 23:14:24.113230"]]
---
  def create
    puts "Creating article..."
    @article = Article.new(article_params)
    if @article.save